app/views/users/edit.html.erb

SELECT "tags".* FROM "tags" ORDER BY "tags"."name" ASC
---
      <%= f.label :tag_list, "Tags, choose your proficient skills (max 8)" %>
      <%= f.collection_check_boxes :tag_ids, Tag.order(:name), :id, :name, {}, {multiple: true} %>