app/views/users/index.html.erb

            <h2 class="">Recommended</h2>
            <% User.all.where.not(role: current_user.role).shuffle.each do |u| %>
---
SELECT "users".* FROM "users" WHERE ("users"."id" != 1) AND ("users"."role" != $1) AND (LOWER(first_name) LIKE '%corey%' or LOWER(last_name) LIKE '%corey%' or LOWER(title) LIKE '%corey%' or LOWER(description) LIKE '%corey%')  [["role", 0]]

                         <% end %>
                          <!-- <% Tag.all.each do |tag| %>
---
SELECT  "tags".* FROM "tags" ORDER BY "tags"."id" ASC LIMIT $1  [["LIMIT", 1]]