app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1  [["conversation_id", 2]]
---
def index
    @messages = @conversation.messages
    if @messages.length > 10

INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Hi, Corey. Would you like to meet?"], ["conversation_id", 1], ["user_id", 2], ["created_at", 2017-02-24 20:22:33 UTC], ["updated_at", 2017-02-24 20:22:33 UTC]]
---
def create
    @message = @conversation.messages.new(message_params)
    if @message.save