app/controllers/tags_controller.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "data analysis"], ["created_at", 2017-01-04 21:12:28 UTC], ["updated_at", 2017-01-04 21:12:28 UTC]]
---
  def create
    @tag = Tag.new(tag_params)
    respond_to do |format|
      if @tag.save

UPDATE "tags" SET "name" = $1, "updated_at" = $2 WHERE "tags"."id" = $3  [["name", "internet of things"], ["updated_at", 2017-01-10 04:38:06 UTC], ["id", 7]]
---
  def update
    respond_to do |format|
      if @tag.update(tag_params)