app/controllers/users_controller.rb

SELECT  "tags".* FROM "tags" ORDER BY "tags"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" JOIN taggings users_taggings_66bc499  ON users_taggings_66bc499.taggable_id = "users".id AND users_taggings_66bc499.taggable_type = 'User' AND users_taggings_66bc499.tag_id = 26
---
  def index
    set_tags
    set_user_type
    set_tags_for_users
    if params[:tag]
        @users = User.all_except(current_user).tagged_with(params[:tag])
    else
        @users = User.all_except(current_user).search(params[:search])

SELECT "tags".* FROM "tags"
---
  def show
      @tags = Tag.all

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "title" = $3, "description" = $4, "linkedin_url" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["first_name", "Jack"], ["last_name", "Harry"], ["title", "Rails Developer"], ["description", "har har har"], ["linkedin_url", "facebook.com"], ["updated_at", 2017-01-09 02:50:39 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('entrepreneurship') OR LOWER(name) = LOWER('design help') OR LOWER(name) = LOWER('code review') OR LOWER(name) = LOWER('ios') OR LOWER(name) = LOWER('backend'))
---
    def set_tags
         @tags = Tag.all

SELECT "users".* FROM "users" WHERE ("users"."id" != 1) AND ("users"."role" != $1) AND (LOWER(first_name) LIKE '%corey%' or LOWER(last_name) LIKE '%corey%' or LOWER(title) LIKE '%corey%' or LOWER(description) LIKE '%corey%')  [["role", 0]]
---
    def set_user_type
        #  @users = User.all
        #  @student_array = Array.new
        #  @mentor_array = Array.new
        #  @alumni_array = Array.new
        #  @users.each do |user|
        #      if user.role == "student"
        #           @student_array.append(user)
        #       elsif user.role == "mentor"
        #           @mentor_array.append(user)
        #       else
        #           @alumni_array.append(user)
        #       end
        #  end

         if current_user.role == "student" || current_user.role == "alumni"
            #   @temp_array = @mentor_array + @student_array + @alumni_array
              @users = User.role("mentor") + User.role("student") + User.role("alumni")

          elsif current_user.role == "mentor"
            #   @temp_array = @student_array
              @users = User.role("student")
          else
            #  @temp_array = @users
             @users = User.all